{
  "backend/main.mo": "Main backend actor that manages user profiles, PDF stories (with categories Islamic/Historical), and contact submissions, integrating authorization mixins and blob storage for PDF handling.",
  "backend/migration.mo": "Migration module that defines an empty migration from an old Book-based schema to a new actor structure, currently performing no data transformation.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: admin story upload page, stories library with category tabs, PDF reader page, and navigation menu integration.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration for the Islahi Kids Books application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using OKLCH color space for consistent design tokens.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tags and a root div for mounting the app.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Home, Contact, Stories, Story Reader, and Admin Upload Story pages within a shared Layout.",
  "frontend/src/components/BookCard.tsx": "Empty file, likely deprecated or unused component for displaying book cards.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company info, quick links, contact section, copyright notice, and attribution to caffeine.ai with UTM tracking.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component that renders Navigation header, page content via Outlet, and Footer in a flex column structure.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation header with logo, desktop/mobile menus for Home, Stories, and Contact links, highlighting the active route.",
  "frontend/src/components/StoryCard.tsx": "Reusable card component displaying story title, author, category badge, truncated description, and a Read Story button linking to the story reader.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useBook.ts": "Empty file with no content.",
  "frontend/src/hooks/useBooks.ts": "Empty file with no content.",
  "frontend/src/hooks/useContactForm.ts": "React hook that provides a mutation for submitting contact form data (name, email, message) to the backend actor and invalidates the contact submissions query on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useIsAdmin.ts": "React hook that queries the backend actor to check if the current caller has admin privileges.",
  "frontend/src/hooks/useStoriesByCategory.ts": "React hook that fetches stories filtered by category from the backend actor using React Query.",
  "frontend/src/hooks/useStory.ts": "React hook that fetches a single story by ID from the backend actor using React Query.",
  "frontend/src/hooks/useUploadStory.ts": "React hook that provides a mutation for uploading stories with PDF files as ExternalBlob, supporting upload progress tracking and invalidating the stories query on success.",
  "frontend/src/index.css": "Global CSS file defining Tailwind utilities, custom CSS variables for light/dark themes with color schemes, and font family configurations using Fredoka and Nunito fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminUploadStory.tsx": "Admin-only page component for uploading stories with form fields for title, category, description, author, and PDF file, featuring upload progress tracking and access control validation.",
  "frontend/src/pages/BookDetail.tsx": "Empty file with no content.",
  "frontend/src/pages/BooksCatalog.tsx": "Empty file with no content.",
  "frontend/src/pages/Contact.tsx": "Contact form page component with fields for name, email, and message, displaying success/error alerts and using the useContactForm hook for submission.",
  "frontend/src/pages/Home.tsx": "Homepage component with hero section, mission statement, features grid, and CTA sections showcasing Islahi Kids Books' educational Urdu stories for children.",
  "frontend/src/pages/Stories.tsx": "Stories library page with tabbed interface for Islamic and Historical categories, displaying story cards with loading states and error handling using custom hooks.",
  "frontend/src/pages/StoryReader.tsx": "PDF story reader page that displays individual stories in an embedded iframe viewer with story metadata and navigation back to the library.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended typography, animations, and child-friendly design tokens including Nunito and Fredoka fonts.",
  "project_state.json": "Project state tracking document listing implemented features for Islahi Kids Books website including homepage, stories library, PDF reader, admin upload, and contact form functionality."
}